tap "1password/tap"
tap "anomalyco/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "mistertea/et"
tap "moovfinancial/moovbrew"
tap "rikeda71/tap"
tap "spacelift-io/spacelift"
tap "umputun/apps"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Java build tool
brew "ant"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# GNU data recovery tool
brew "ddrescue"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Fast, partial replacement for codemod (find/replace tool for programmers)
brew "fastmod"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Google Drive CLI Client
brew "gdrive"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Tool for glamorous shell scripts
brew "gum"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Library to render SVG files using Cairo
brew "librsvg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Apache Kafka C/C++ library
brew "librdkafka"
# Compression program with a very high compression ratio
brew "lrzip"
# Control external displays (USB-C/DisplayPort Alt Mode) using DDC/CI on M1 Macs
brew "m1ddc"
# Remote terminal application
brew "mosh"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI for Playwright: record/generate code, inspect selectors, take screenshots
brew "playwright-cli"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Command-line agent for Cursor
cask "cursor-cli"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Email client
cask "fastmail"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Native desktop AI assistant from Google
cask "google-gemini"
# Grammarly for desktop
cask "grammarly-desktop"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Agent-centric IDE with spec-driven development
cask "kiro"
# App to manage software development and track bugs
cask "linear"
# Markdown editor with live preview and syntax highlighting
cask "macdown-3000"
# Markdown editor
cask "mark-text"
# Previewer for Markdown, MultiMarkdown and other text markup languages
cask "marked-app"
# Multi-platform web browser
cask "microsoft-edge"
# CSV editor
cask "modern-csv"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# File sync and share software
cask "resilio-sync"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
vscode "github.codespaces"
vscode "mechatroner.rainbow-csv"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
go "golang.org/x/vuln/cmd/govulncheck"
go "go.uber.org/nilaway/cmd/nilaway"
uv "spec-kitty-cli", source: "file:///Users/ray.johnson/src/rayjohnson/spec-kitty"
uv "spec-kitty-orchestrator", source: "file:///Users/ray.johnson/src/rayjohnson/spec-kitty-orchestrator"
npm "@1mcp/agent"
npm "@vibe-kit/grok-cli"
npm "pnpm"
