tap "1password/tap"
tap "ankitpokhrel/jira-cli"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "mistertea/et"
tap "spacelift-io/spacelift"
brew "bash"
brew "bash-completion"
brew "openssl@3"
brew "chezmoi"
brew "zstd"
brew "curl"
brew "docker"
brew "gemini-cli"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "librdkafka"
brew "nb"
brew "pkgconf"
brew "python@3.11"
brew "qpdf"
brew "telnet"
brew "wget"
brew "yq"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
brew "spacelift-io/spacelift/spacectl"
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "goland"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "linear-linear"
cask "microsoft-edge"
cask "monitorcontrol"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "resilio-sync"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
vscode "github.codespaces"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
go "golang.org/x/vuln/cmd/govulncheck"
