tap "1password/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "mistertea/et"
tap "moovfinancial/moovbrew"
tap "rikeda71/tap"
tap "spacelift-io/spacelift"
tap "umputun/apps"
brew "age"
brew "bash"
brew "bash-completion"
brew "chezmoi"
brew "openssl@3"
brew "zstd"
brew "curl"
brew "dark-mode"
brew "docker"
brew "dust"
brew "fd"
brew "fzf"
brew "gdrive"
brew "gemini-cli"
brew "gh"
brew "git"
brew "glow"
brew "go"
brew "jq"
brew "librdkafka"
brew "librsvg"
brew "pkgconf"
brew "python@3.11"
brew "qpdf"
brew "shellcheck"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
brew "moovfinancial/moovbrew/eng-scripts"
brew "umputun/apps/revdiff"
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "dropbox"
cask "firefox"
cask "font-jetbrains-mono"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "home-assistant"
cask "linear"
cask "microsoft-edge"
cask "modern-csv"
cask "monitorcontrol"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "resilio-sync"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
vscode "github.codespaces"
vscode "mechatroner.rainbow-csv"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
go "golang.org/x/vuln/cmd/govulncheck"
go "go.uber.org/nilaway/cmd/nilaway"
